{
    "project1": {
        "title": "Booki",
        "description": "Une web de réservation de vacances, intégrant HTML et CSS à partir de la maquette Figma.",
        "context": "Le projet consiste à intégrer les maquettes desktop, tablette et mobile fournies, tout en respectant les spécifications et contraintes techniques précisées. Pour cela, une structure de fichiers ainsi qu'une base de code HTML et CSS sont fournies. Ensuite, le projet doit être complété en conservant cette structure et versionné via GitHub.",
        "objectives": "Découper et intégrer une maquette Figma en HTML et CSS responsive.",
        "date": "Avril 2025"
    },
    "project2": {
        "title": "Shopie Bluel",
        "description": "Web d'architecture avec login pour la propriétaire et gestion de formulaires en JavaScript pur.",
        "context": "En tant que développeur front-end, j’intègre une équipe chargée de la création du site portfolio d’une architecte d’intérieur. Je dispose du Figma, du code back-end et front-end existant ainsi que du Kanban, ce qui me permet de suivre mes tâches et de commencer le développement des nouvelles fonctionnalités de manière structurée.",
        "objectives": "L’objectif général du projet est de développer un site portfolio fonctionnel et interactif. Les objectifs spécifiques incluent la mise en place d’un login opérationnel, la gestion des données avec le localStorage, et la création et suppression dynamique d’images.",
        "date": "Mai 2025"
    },
    "project3": {
        "title": "Nina Carducci",
        "description": "Debug et optimisation d'une web de photographe avec Lighthouse, Rich Snippets et Wave.",
        "context": "En tant que développeur web freelance, j’interviens sur le site de la photographe Nina Carducci afin d’optimiser ses performances, son référencement et son accessibilité. Le projet repose sur l’analyse d’un audit initial, la correction de bugs existants et la mise en œuvre d’améliorations techniques sur le code front-end et back-end fourni, en collaboration avec la cliente.",
        "objectives": "Les objectifs du projet consistent à rendre le site plus rapide et performant, à renforcer sa visibilité grâce au SEO et au référencement local, à intégrer les metas pour les réseaux sociaux, à corriger les dysfonctionnements existants, et à garantir une accessibilité optimale, tout en produisant un suivi détaillé des améliorations apportées.",
        "date": "Juin 2025"
    },
    "project4": {
        "title": "Kasa",
        "description": "Plateforme de réservation de vacances inspirée d’Airbnb. Interface interactive avec menus, évaluations, fiches et carrousel d’images.",
        "context": "En tant que développeur front-end freelance pour Kasa, je participe à la refonte complète du site en React, en développant les composants et routes selon les maquettes Figma et en intégrant les données des annonces fournies en JSON, tout en respectant les contraintes fonctionnelles et visuelles.",
        "objectives": "Les objectifs du projet sont de développer l’ensemble des composants React de l’application, de configurer les routes avec React Router, de gérer dynamiquement l’affichage des annonces et des galeries d’images, et d’assurer que l’interface soit responsive et conforme aux maquettes Figma.",
        "date": "Juillet 2025"
    },
    "project5": {
        "title": "Mon vieux grimoire",
        "description": "Page web de valorisation de livres avec backend Node, Express et MongoDB.",
        "context": "En tant que développeur back-end freelance, je suis chargé de créer l’API du site « Mon Vieux Grimoire », permettant la gestion des livres, des notes utilisateurs et l’optimisation des images, en assurant la compatibilité avec le front-end React existant.",
        "objectives": "Les objectifs principaux du projet sont de créer un serveur Express fonctionnel, de développer l’API pour gérer les livres et les notes, d’implémenter un système d’authentification sécurisé, d’assurer la gestion des fichiers utilisateurs et de permettre l’ajout de notes avec le calcul automatique de la note moyenne.",
        "date": "Août 2025"
    }
}
